Repository: xccui/SPWAF-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: A Flink application that runs with fault tolerance enabled periodically takes a check‐ point of its state.
zh_cn: 在启用容错功能的情况下，Flink会周期性地将应用状态存储检查点中。

source: A Flink process (JobManager or Task‐ Manager) instantiates one FileSystem object for each configured filesystem and shares it across all local tasks to guarantee that configured constraints such as limits
zh_cn: Flink进程（JobManager或TaskManager）会为每个配置的文件系统实例化一个FileSystem对象，并让它们在所有本地任务之间共享以保证配置的约束（例如开启的最大连接数）可以生效。

source: A Flink setup consists for four different components that work together to execute streaming applications.
zh_cn: Flink的设置包含4个不同组件，它们相互协作，共同执行流式应用。

source: A Flink setup consists of four different components that work together to execute streaming applications.
zh_cn: Flink的搭建需要四个不同组件，它们相互协作、共同执行流式应用。

source: A Flink setup consists of multiple processes that typically run distributed across multiple machines.
zh_cn: 它的搭建涉及多个进程，它们通常会分布在多台机器上。

source: A Flink setup for Kubernetes is defined with two deployments—one for the pod run‐ ning the master process and the other for the worker process pods.
zh_cn: 在Kubernetes上搭建Flink需要通过两个Deployment来完成——一个用于运行主进程的Pod，另一个用于工作进程的Pod。

source: A Flink standalone deployment does not rely on a resource provider, such as YARN or Kubernetes.
zh_cn: Flink独立集群部署模式无须依赖YARN或Kubernetes这样的资源提供者。

source: A Flink worker process stores data on the local filesystem for multiple reasons, including receiving application JAR files, writing log files, and maintaining applica‐
zh_cn: 出于多种原因，Flink的工作进程需要在本地文件系统上存储数据，其中包括接收应用的JAR包，写日志，以及在配置了RocksDB状态后端时维护状态。

source: A Function Cannot Choose Which ConnectedStreams to Read
zh_cn: 函数无法选择从哪条流读取数据

source: A Gauge metric calculates a value of any type at a point in time.
zh_cn: Gauge指标用于计算在某个时间点一个任意类型的值。

source: A JobManager requests one or more slots to execute an application.
zh_cn: JobManager需要请求一个或多个处理槽来执行应用。

source: A Kafka sink is added to a DataStream application as shown in Example 8-2.
zh_cn: 示例8-2中展示了如何将Kafka数据汇添加到DataStream应用中。

source: A Kafka source connector is created as shown in Example 8-1.
zh_cn: 示例8-1展示了如何创建一个Kafka数据源连接器。

source: A KeySelector function extracts a key from an input event:
zh_cn: 它可以从输入事件中提取键值：

source: A KeySelector function receives an input item and returns a key.
zh_cn: KeySelector函数接受一个输入项，返回一个键值。

source: A Keyed Stream is constructed by calling the DataStream.keyBy() method that defines a key on a stream.
zh_cn: 你可以通过在一条数据流上调用定义键值的DataStream.keyBy()方法来得到一个KeyedStream。

source: A KeyedProcessFunction that emits a warning if the temperature of a sensor monotonically increases for 1 second in processing time
zh_cn: KeyedProcessFunction，如果传感器温度在处理时间1秒内持续增加，则发出警告

source: A KeyedStream can be processed using the map, flatMap, and filter transformations that you saw earlier.
zh_cn: KeyedStream也支持使用你之见看到过的map、flatMap和filter等转换进行处理。

source: A KeyedStream is partitioned on the specified key and remembers the key definition.
zh_cn: KeyedStream会根据指定键值进行分区并记住键值的定义。

source: A Kubernetes deployment for a Flink master
zh_cn: 用于Flink主进程的Kubernetes Deployment

source: A Kubernetes deployment for two Flink workers
zh_cn: 针对两个Flink工作进程的Kubernetes Deployment

source: A Kubernetes service for the Flink master
zh_cn: 针对Flink主进程的Kubernetes Service

source: A ProcessFunction that emits records to a side output
zh_cn: 向副输出发送记录的ProcessFunction

source: A ProcessFunction that filters out late sensor readings and redirects them to a side output
zh_cn: 用于过滤出迟到的传感器读数并将其重定向到副输出的ProcessFunction

source: A ProcessWindowFunction that computes the lowest and highest temperature
zh_cn: 该ProcessWindowFunction用于计算每个窗口内的最低和最高温度读数，

source: A ProcessWindowFunction that utilizes per- window state needs to implement its clear() method to clean up any window-
zh_cn: 使用了单个窗口状态的ProcessWindowFunction需要实现clear()方法，在窗口清除前清理仅供当前窗口使用的状态。

source: A Quick Look at Flink
zh_cn: Flink快览

source: A Quick Look at Flink | 13
zh_cn: Flink快览| 13

source: A ReduceFunction accepts two values of the same type and combines them into a single value of the same type.
zh_cn: ReduceFunction接收两个同类型的值并将它们组合成一个类型不变的值。

source: A RichFlatMapFunction with operator list state
zh_cn: 使用了算子列表状态的RichFlatMapFunction

source: A RollingPolicy determines when a task creates a new part file.
zh_cn: RollingPolicy用来决定任务何时创建一个新的分块文件。

source: A StreamingFileSink in bulk-encoding mode cannot choose a Roll ingPolicy.
zh_cn: 工作在批量编码模式下的StreamingFileSink无法选择RollingPolicy。

source: A StreamingFileSink in bulk-encoding mode requires a BulkWriter.Factory.
zh_cn: 批量编码模式下的StreamingFileSink需要接收一个BulkWriter.Factory。

source: A TaskManager can execute several tasks at the same time.
zh_cn: 一个TaskManager允许同时执行多个任务。

source: A TaskManager container registers itself at the JobMaster and offers its processing slots.
zh_cn: TaskManager容器会将自身和所提供的处理槽在JobMaster上注册。

source: A TaskManager executes its tasks multi-threaded in the same JVM process.
zh_cn: TaskManager会在同一个JVM进程内以多线程的方式执行任务。

source: A TaskManager executes its tasks multithreaded in the same JVM process.
zh_cn: TaskManager会在同一个JVM进程内以多线程的方式执行任务。

source: A TaskManager needs one dedicated network buffer for each receiving task that any of its tasks need to send data to.
zh_cn: 对于每一个接收任务，TaskManager都要提供一个专用的网络缓冲区，用于接收其他任务发来的数据。

source: A TaskManager offers a certain number of processing slots to control the number of tasks it is able to concurrently execute.
zh_cn: TaskManager通过提供固定数量的处理槽来控制可以并行执行的任务数。

source: A TaskManager process (and with it, all tasks running on it) may fail at any point in time.
zh_cn: 而考虑到TaskManager进程以及它上面所有运行的任务都可能在任意时间出现故障，

source: A TaskManager provides a certain number of processing slots to control the number of tasks that it can concurrently execute.
zh_cn: TaskManager通过提供一定数量的处理槽来控制可以并发执行的任务数。

source: A TaskManager provides a certain number of slots that are registered at and governed by the ResourceManager.
zh_cn: 每个TaskManager都能提供一定数量的处理槽，这些处理槽由ResourceManager统一注册和管理。

source: A Taste of Flink
zh_cn: 初识Flink

source: A TypeSerializer to serialize the input records
zh_cn: 一个用于序列化输入记录的TypeSerializer

source: A WAL sink that writes to the standard output
zh_cn: 写入标准输出的WAL数据汇

source: A Welcoming Community
zh_cn: 欢迎加入社区

source: A Welcoming Community | 283
zh_cn: 欢迎加入社区 | 283

source: A WindowAssigner is typed to the type of the incoming elements and the type of the windows to which the elements are assigned.
zh_cn: WindowAssigner的类型由到达元素的类型以及元素分配的目标窗口类型组成。

source: A background thread asynchronously copies the local snapshot to the remote storage and notifies the task once it completes the checkpoint.
zh_cn: 后台进程会异步将本地状态快照拷贝到远程存储，然后在完成检查点后通知任务。

source: A bucket is a subdirectory of the base path that is configured with the builder of Stream ingFileSink—"/base/path" in Example 8-4.
zh_cn: 每个桶都代表了由StreamingFileSink构建器配置的基础路径（示例8-4中的"/bash/path"）下的一个子目录。

source: A bulk-encoding StreamingFileSink is created as shown in Example 8-5.
zh_cn: 示例8-5展示了如何创建一个批量编码的StreamingFileSink。

source: A checkpoint barrier carries a checkpoint ID to identify the checkpoint it belongs to and logically splits a stream into two parts.
zh_cn: 为了标识所属的检查点，每个检查点分隔符都会带有一个检查点编号，这样就把一条数据流从逻辑上分成了两个部分。

source: A checkpoint is committed in two steps.
zh_cn: 该过程分为两步。

source: A checkpoint is initiated by the JobManager by sending a message with a new check‐ point ID to each data source task as shown in Figure 3-20.
zh_cn: 如图3-20所示，JobManager会向每个数据源任务发送一个新的检查点编号，以此来启动检查点生成流程。

source: A client submits a job to the Dispatcher, which internally starts a JobManager thread and provides the JobGraph for execution.
zh_cn: 客户端将作业提交到Dispatcher，后者会在内部启动一个JobManager线程并提供用于执行的JobGraph。

source: A common approach is to mount a network-shared directory with the Flink distri‐ bution on each machine.
zh_cn: 常用方法是将存有Flink发行版的网络共享目录（network-shared directory）挂载到每台机器上。

source: A common case is when a task per‐ forms idempotent operations, like maximum or minimum.
zh_cn: 一个常见情况就是某个任务执行一些诸如求最大值或最小值的幂等操作。

source: A common case is when a task performs idempotent operations, like maximum or min‐ imum.
zh_cn: 一个常见情况就是某个任务执行一些诸如求最大值或最小值的幂等操作。

source: A common command-line tool to interact with REST API is curl.
zh_cn: curl是一个在命令行模式下与REST API进行交互的常见工具。

source: A common example is invalid or corrupt input data the application is not able to handle.
zh_cn: 一个常见的例子是输入中出现了应用无法处理的无效或损坏数据。

source: A common pattern is to write results into a database or key-value store and have other applications retrieve the result from that datastore.
zh_cn: 常见的分享模式是把结果写入数据库或键值存储中，再由其他应用从这些存储中获取结果。

source: A common reason for growing state is keyed state on an evolving key domain.
zh_cn: 导致状态增长的一个常见原因是键值状态的键值域不断发生变化。

source: A common requirement for streaming applications is to adjust the parallelism of operators due to increasing or decreasing input rates.
zh_cn: 流式应用的一项基本需求是根据输入数据到达速率的变化调整算子并行度。

source: A common requirement in streaming applications is to distribute the same informa‐ tion to all parallel instances of a function and maintain it as recoverable state.
zh_cn: 流式应用的一个常见需求是将相同信息发送到函数的所有并行实例上，并将它们作为可恢复的状态进行维护。

source: A common requirement of many applications is to process groups of events that share a certain property together.
zh_cn: 很多应用需要将事件按照某个属性分组后再进行处理。

source: A common requirement when working with streams is to connect or join the events of two streams.
zh_cn: 数据流操作的另一个常见需求是对两条数据流中的事件进行联结（connect）或Join。

source: A common use case for timers is to clear keyed state after some period of inactivity for a key or to implement custom time-based windowing logic.
zh_cn: 它的常见用途是在某些键值不再使用后清除键值分区状态或实现一些基于时间的自定义窗口逻辑。

source: A consistent checkpoint of a stateful streaming application is a copy of the state of each of its tasks at a point when all tasks have processed exactly the same input.
zh_cn: 状态化流式应用的一致性检查点是在所有任务处理完等量的原始输入后对全部任务状态进行的一个拷贝。

source: A consistent checkpoint of a streaming application
zh_cn: 某流式应用的一致性检查点

source: A container is started from an image that defines the software in the container.
zh_cn: 容器需要通过定义其内部软件的镜像启动。

source: A container that is started from this image automati‐ cally starts a TaskManager, which connects to the ResourceManager and registers its slots.
zh_cn: 容器通过镜像启动后会自动运行TaskManager，后者可以连接ResourceManager并注册处理槽。

source: A counterexample is a source connector that reads data from a network socket, which immediately discards delivered the data.
zh_cn: 反例是从网络套接字读取数据的数据源连接器，套接字会在数据传递后立即将其丢弃。

source: A custom trigger may fire several times, computing new or updated results
zh_cn: 自定义触发器可能会触发多次，你不但可以计算全新的结果或对已有结果进行更新，

source: A data source can ingest data from a TCP socket, a file, a Kafka topic, or a sensor data interface.
zh_cn: 数据源可以从TCP套接字、文件、Kafka主题或传感器数据接口中获取数据。

source: A data stream is a potentially unbounded sequence of events
zh_cn: 数据流是一个可能无限的事件序列

source: A data warehouse is a specialized database system for analytical query workloads.
zh_cn: 数据仓库是一个用来执行分析类查询的专业化数据库系统。

source: A dataflow graph must have at least
zh_cn: 一个dataflow图至少要有一个数据源和一个数据汇。

source: A dataflow graph must have at least one data source and one data sink.
zh_cn: 一个Dataflow图至少要有一个数据源和一个数据汇。

source: A dependency that is added to the classpath like this is available to (and might interfere with) all applications that run on the Flink setup.
zh_cn: 像这样加入Classpath的依赖会对一个Flink设置中所有运行的应用可见（可能会产生干扰）。

source: A deployment defines a specific number of pods, or containers, to run.
zh_cn: 一个Deployment定义了一组需要运行的特定数量的Pod或容器。

source: A detached Flink session can be
zh_cn: 并利用YARN的应用工具（application utilities）将其终止。

source: A failure can occur during any of these steps and the system has to
zh_cn: 上述任何一个步骤都可能发生故障，系统必须在故障场景下明确定义其行为。

source: A failure can occur during any of these steps and the system has to clearly define its behavior in a failure scenario.
zh_cn: 上述任何一个步骤都可能发生故障，而系统必须在故障情况下明确定义其行为。

source: A failure recovery would fail if Flink attempted to recover from a savepoint that was removed.
zh_cn: 如果恢复的目标保存点已经删除，则故障恢复过程将会失败。

source: A filesystem is represented in Flink by an implementation of the org.apache.flink.core.fs.FileSystem class.
zh_cn: 在Flink中，每个文件系统都由org.apache.flink.core.fs.FileSystem类的一个实现来表示。

source: A filter operation that only retains white values
zh_cn: 仅保留白色值的Filter操作。

source: A filter transformation is specified by calling the DataStream.filter() method and pro‐
zh_cn: 通过调用DataStream.filter()方法可以指定filter转换产生一个数据类型不变的DataStream。

source: A flatMap operation that outputs white squares, duplicates black squares, and drops gray squares
zh_cn: 输出白色方块，复制黑色方块，丢弃灰色方块的flatMap操作

source: A full data type can be selected using the wildcard field expression "_" (underscore character):
zh_cn: 可以使用通配符字段表达式"_"选择全部字段：

source: A function can work with operator list state by implementing the ListCheckpointed interface.
zh_cn: 若要在函数中使用算子列表状态，需要实现ListCheckpointed接口。

source: A function implementing the CheckpointedFunction interface
zh_cn: 实现了CheckpointedFunction接口的函数

source: A function is implemented by implementing the interface or extending the abstract class.
zh_cn: 因此可以通过实现接口或继承抽象类的方式实现函数。

source: A function with broadcast state is applied on two streams in three steps:
zh_cn: 为了在两条数据流上应用带有广播状态的函数需要经过三个步骤：

source: A function with keyed state must be applied on a KeyedStream.
zh_cn: 使用键值分区状态的函数必须作用在KeyedStream上，

source: A highly available Flink setup
zh_cn: Flink高可用设置

source: A highly-available Flink Setup.
zh_cn: Flink高可用设置。

source: A job ID that is passed to the CheckpointCommitter to identify commit informa‐ tion across application restarts
zh_cn: 一个传递给CheckpointCommitter，用于应用重启后标识提交信息的任务ID

source: A job can recover from a worker failure if a sufficient number of processing slots is available.
zh_cn: 只要有足够多的剩余处理槽，作业就可以从工作进程故障中恢复。

source: A key group is a partition of keys and Flink’s way of assigning keys to tasks.
zh_cn: 每个键值组都包含了部分键值，Flink以此为单位把键值分配给不同任务。

source: A keyBy operation that partitions events based on color
zh_cn: 基于颜色对事件进行分区的keyBy操作

source: A late element is an element that arrives at an operator when a computation to which it would need to contribute has already been performed.
zh_cn: 所谓迟到指的是元素到达算子后，它本应参与贡献的计算已经执行完毕。

source: A local Flink cluster is started by calling ./bin/ start-cluster.sh.
zh_cn: Flink本地集群的启动方式是执行./bin/start-cluster.sh。

source: A local or distributed standalone cluster is
zh_cn: 还可以利用./bin/stop-cluster.sh脚本来停止本地或分布式独立集群。

source: A logical dataflow graph to continuously count hashtags (nodes represent operators and edges denote data dependencies)
zh_cn: 一个持续统计主题标签数目的Dataflow逻辑图（顶点表示算子，边表示数据依赖）。

source: A logical dataflow graph to continuously count hashtags.
zh_cn: 持续计算主题标签数量的dataflow逻辑图。

source: A map operation that transforms every square into a circle of the same color
zh_cn: 将方形转换为相同颜色圆形的map操作。

source: A master process mainly manages compute resources (ResourceManager) and coordinates the execution of applications (JobManager), while a worker process takes care of the heavy lifting and processes potentially large amounts of data.
zh_cn: 主进程主要管理计算资源（ResourceManager）和协调应用（JobManager）执行；而工作进程要负责繁重的工作以及处理潜在庞大规模的数据。

source: A microservice architecture
zh_cn: 微服务架构

source: A microservices architecture
zh_cn: 微服务架构

source: A minimum Properties configu‐ ration consists of two entries, "bootstrap.servers" and "group.id".
zh_cn: Properties至少需要两个配置项，"bootstrap.servers"和"group.id"。

source: A more challenging problem than TaskManager failures are JobManager failures.
zh_cn: 和TaskManager相比，JobManager发生故障会更为棘手。

source: A new JobManager that takes over the work of the failed master performs the following steps.
zh_cn: 新接手工作的JobManager会执行以下步骤：

source: A new JobManager that takes over the work of the failed master performs the following steps:
zh_cn: 新接手工作的JobManager会执行以下步骤：

source: A new watermark is emitted if the method returns a
zh_cn: 如果该方法返回一个非空、且大于之前值的水位线，算子就会将这个新水位线发出。

source: A parallel count-based tumbling window of length 2
zh_cn: 基于数量2的并行滚动窗口

source: A parallel count-based tumbling window of length 2.
zh_cn: 基于数量2的并行滚动窗口。

source: A path to a Flink archive
zh_cn: Flink归档文件路径

source: A path to an application JAR file
zh_cn: 应用程序JAR文件路径

source: A periodic watermark assigner
zh_cn: 周期性水位线分配器

source: A physical dataflow plan for counting hashtags (nodes represent tasks)
zh_cn: 主题标签计数的物理Dataflow计划（顶点表示任务）

source: A physical dataflow plan for counting hashtags.
zh_cn: 主题标签计数的物理dataflow计划，

source: A pod is a container that is started and managed by Kubernetes.4
zh_cn: Pod是由Kubernetes启动并管理的容器。4

source: A precommitted trans‐ action may not receive further writes.
zh_cn: 预提交过后的事务将不再接收额外的数据写入。

source: A process function can easily filter out late events by comparing their timestamps with the current watermark.
zh_cn: 处理函数可以通过比较时间戳和当前水位线的方式轻松过滤掉迟到事件。

source: A process function can identify late events by comparing event timestamps with the current watermark and emitting them using the regular side-output API.
zh_cn: 处理函数可以通过比较事件时间的时间戳和当前水位线来识别迟到事件，并使用常规的副输出API将其发出。

source: A processing slot can execute one slice of an application—one parallel task of each operator of the application.
zh_cn: 每个处理槽可以执行应用的一部分，即算子的一个并行任务。

source: A processing slot is able to execute one slice of an application, i.e., one parallel task of each operator of the application.
zh_cn: 每个处理槽可以执行应用的一部分，即应用内算子的一个并行任务。

source: A processing-time window continues counting time even after Alice’s phone gets disconnected
zh_cn: 在爱丽丝手机离线后继续计时的处理时间窗口

source: A processing-time window continues counting time when Alice’s phone gets disconnected.
zh_cn: 在爱丽丝手机离线后继续计时的处理时间窗口。

source: A processing-time window includes all events that happen to have arrived at the window operator within a time period, as meas‐ ured by the wall-clock of its machine.
zh_cn: 基于处理时间的窗口包含了那些恰好在一段时间内到达窗口算子的事件，这里的时间段是按照机器时间测量的。

source: A processing-time window includes all events that happen to have arrived at the window operator within a time period, as meas‐ ured by the wall clock of its machine.
zh_cn: 基于处理时间的窗口会包含那些恰好在一段时间内到达窗口算子的事件，这里的时间段是按照机器时间测量的。

source: A project import wizard will guide you though the next steps, such as selecting the Maven project to import (there should only be one), selecting the SDK, and naming the project.
zh_cn: 根据导入向导的指示完成后续步骤，例如：选择要导入的Maven项目（应该只有一个），选择SDK，为项目命名。

source: A punctuated watermark assigner
zh_cn: 定点水位线分配器

source: A query must not be configured to emit POJOs.
zh_cn: 如果是POJO的情况，则不可指定。

source: A receiving task grants some credit to a sending task, i.e., a number of network buffers that are reserved to receive its data.
zh_cn: 一个接收任务会给一个发送任务授予一定的信用度，其实就是保留一些用来接收它数据的网络缓冲。

source: A receiving task grants some credit to a sending task, the number of network buffers that are reserved to receive its data.
zh_cn: 接收任务会给发送任务授予一定的信用值，其实就是保留一些用来接收它数据的网络缓冲。

source: A recent approach to overcome the tight bundling of applications is the microservice design pattern.
zh_cn: 近些年提出的微服务模式可以克服这种应用紧耦合情况。

source: A recent approach to overcoming the tight bundling of applications is the microservices design pattern.
zh_cn: 近些年提出的微服务设计模式可以克服这种应用紧耦合情况。

source: A reduce transformation does
zh_cn: reduce转换不会改变数据类型，

source: A request ID to check whether the rescaling request was successful or not
zh_cn: 一个用于检查扩缩容操作是否成功完成的请求ID

source: A request ID to check whether the savepoint trigger action completed successfully
zh_cn: 一个用于检查保存点所触发的操作是否已经成功完成的请求ID

source: A request ID to check whether the savepoint was successfully disposed or not
zh_cn: 用于检查保存点是否已经成功删除的请求ID

source: A request to cancel the application will only succeed if the save‐ point was successfully taken.
zh_cn: 只有在保存点成功创建后，取消应用的请求才会生效。

source: A resettable SourceFunction
zh_cn: 可重置的SourceFunction

source: A resettable source function needs to implement the Checkpoin tedFunction interface and should store the reading offsets and all related meta infor‐ mation, such as file paths or partition ID, in operator list state or operator union list
zh_cn: 可重置的数据源函数需要实现CheckpointedFunction接口，并把所有读取偏移和相关的元数据信息（例如文件路径或分区ID）存入算子列表状态或算子联合列表状态中。

source: A return value of true preserves the input event and forwards it to the output, and false results in dropping the event.
zh_cn: 如果返回值为true，那么它会保留输入事件并将其转发到输出，否则它会把事件丢弃。

source: A rolling aggregation does not require a user-defined func‐ tion but receives an argument that specifies on which field the aggregate is computed.
zh_cn: 滚动聚合虽然不需要用户自定义函数，但需要接收一个用于指定聚合目标字段的参数。

source: A rolling aggregation is an aggregation, such as sum, minimum, and maximum, that is continuously updated for each input event.
zh_cn: 滚动聚合（例如求和、求最小值和求最大值）会根据每个到来的事件持续更新结果。

source: A rolling aggre‐ gate operator keeps an aggregated value for every observed key.
zh_cn: 滚动聚合算子会对每一个遇到过的键值保存一个聚合结果。

source: A rolling maximum of the input stream on the specified field.
zh_cn: 滚动计算输入流中指定字段的最大值。

source: A rolling maximum of the input stream that returns the event with the highest
zh_cn: 滚动计算输入流中迄今为止最大值，返回该值所在事件。

source: A rolling minimum aggregation operation
zh_cn: 求最小值的滚动聚合操作

source: A rolling minimum aggregation operation.
zh_cn: 求最小值的滚动聚合操作。

source: A rolling minimum of the input stream on the specified field.
zh_cn: 滚动计算输入流中指定字段的最小值。

source: A rolling minimum of the input stream that returns the event with the lowest
zh_cn: 滚动计算输入流中迄今为止最小值，返回该值所在事件。

source: A rolling sum of the input stream on the specified field.
zh_cn: 滚动计算输入流中指定字段的和。

source: A savepoint can be taken for a running application with the command-line client as follows:
zh_cn: 你可以在命令行客户端使用如下命令为正在运行的应用生成一个保存点：

source: A savepoint consists mainly of serialized state data.
zh_cn: 保存点主要由序列化后的状态数据组成。

source: A savepoint is a directory in a persistent data storage.
zh_cn: 每个保存点都对应一个持久化数据存储上的目录。

source: A savepoint is basically identical to a checkpoint—it is a consistent and complete snapshot of an application’s state.
zh_cn: 保存点和检查点本质上类似，二者都是应用状态的一致性完整快照，

source: A savepoint is removed with the command:
zh_cn: 删除保存点的的命令是：

source: A savepoint will always be started regardless of how many checkpoints are in progress.
zh_cn: 无论有多少检查点生正在生成过程中，保存点操作都会照常触发。

source: A second, job-independent image is used to deploy TaskManager containers.
zh_cn: 另一个和作业无关的镜像负责部署TaskManager容器。

source: A second, job-independent image is used to deploy TaskManagers containers.
zh_cn: 另一个和作业无关的映像负责部署TaskManager容器。

source: A service defines a policy for how a certain group of pods can be accessed.
zh_cn: 一个Service定义了一组Pod的访问策略。

source: A session window assigner places elements into nonoverlapping windows of activity of varying size.
zh_cn: 会话窗口将元素放入长度可变且不重叠的窗口中。

source: A session window assigner places elements into varying size windows defined
zh_cn: 会话窗口分配器将元素置于由会话间隔决定的大小的可变窗口中

source: A shorter checkpointing interval causes higher overhead during regu‐ lar processing but can enable faster recovery because less data needs to be reproc‐ essed.
zh_cn: 较短的间隔会为常规处理带来较大的开销，但由于恢复时要重新处理的数据量较小，所以恢复速度会更快。

source: A similar effect appears for operators with two input streams whose watermarks sig‐ nificantly diverge.
zh_cn: 当算子两个输入流的水位线差距很大时，也会产生类似影响。

source: A simple SinkFunction that writes to a socket
zh_cn: 一个简单的套接字写入SinkFunction

source: A simple dashboard application that queries the state of a Flink application
zh_cn: 一个简单的Flink应用状态查询仪表盘

source: A simple example is a task that continuously counts how many records it receives.
zh_cn: 我们以一个持续计算接收到多少条记录的简单任务为例。

source: A sliding window assigner places elements into fixed-size, possibly overlap‐ ping windows
zh_cn: 滑动窗口分配器将元素置于大小固定且可能重叠的窗口中

source: A so-called type extractor analyzes the generic types and return types of all functions to obtain the respective TypeInformation objects.
zh_cn: 一个名为类型提取器的组件会分析所有函数的泛型类型及返回类型，以获取相应的TypeInformation对象。

source: A solution for this problem is to remove the state of expired keys.
zh_cn: 该问题的解决方案是从状态中删除那些过期的键值。
